resume.tex
% Created 2025-10-15 Wed 16:42
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,a4paper,ragged2e,withhyper]{altacv}

% Change the page layout if you need to
\geometry{left=1.25cm,right=1.25cm,top=1.5cm,bottom=1.5cm,columnsep=1.2cm}

% Use roboto and lato for fonts
\renewcommand{\familydefault}{\sfdefault}

% Change the colours if you want to
\definecolor{SlateGrey}{HTML}{2E2E2E}
\definecolor{LightGrey}{HTML}{666666}
\definecolor{DarkPastelRed}{HTML}{080845}
\definecolor{PastelRed}{HTML}{0D0D8F}
\definecolor{GoldenEarth}{HTML}{C1E792}
\colorlet{name}{black}
\colorlet{tagline}{PastelRed}
\colorlet{heading}{DarkPastelRed}
\colorlet{headingrule}{GoldenEarth}
\colorlet{subheading}{PastelRed}
\colorlet{accent}{PastelRed}
\colorlet{emphasis}{SlateGrey}
\colorlet{body}{LightGrey}

% Change some fonts, if necessary
\renewcommand{\namefont}{\Huge\rmfamily\bfseries}
\renewcommand{\personalinfofont}{\footnotesize}
\renewcommand{\cvsectionfont}{\LARGE\rmfamily\bfseries}
\renewcommand{\cvsubsectionfont}{\large\bfseries}

% Change the bullets for itemize and rating marker
% for cvskill if you want to
\renewcommand{\itemmarker}{{\small\textbullet}}
\renewcommand{\ratingmarker}{\faCircle}

\usepackage[rm]{roboto}
\usepackage{lato}
\usepackage{paracol}
\columnratio{0.6}
\usepackage[bottom]{footmisc}
\author{Druhan Rajiv Shah}
\date{\today}
\title{}
\usepackage[style=apa]{biblatex}
\addbibresource{resume.bib}
\addbibresource{~/Research/Bibliography/NLP-Stuff.bib}
\addbibresource{~/Research/Bibliography/Math-Stuff.bib}
\addbibresource{~/Research/Bibliography/Other-Fun-Stuff.bib}
\begin{document}

\name{Druhan Shah}
\tagline{Undergraduate Student Researcher}
\personalinfo{
  \email{druhanrshah@gmail.com}
  \phone{+91 89518 19550}
  \location{Hyderabad, India}
  \github{DruhanShah}
  \linkedin{druhan-shah}
}
\makecvheader
\begin{paracol}{2}
\cvsection{Education}
\label{sec:orgacfed7b}

\cvevent{MS in Computational Linguistics by Research}{ IIIT Hyderabad}{ Nov 2021 -- Ongoing}{}
\par\divider

\cvevent{BTech (Hons) in Computer Science}{ IIIT Hyderabad}{ Nov 2021 -- Ongoing}{}
\par
\cvsection{Experience}
\label{sec:org6d4d551}

\cvevent{Undergraduate Researcher}{ Language Technologies Research Centre}{ May 2023 -- Ongoing}{ IIIT Hyderabad}

Exploring Mechanistic Interpretability of Language Models using formal languages.
\par
\cvsection{Projects}
\label{sec:org33f1ed2}

\cvevent{Numerical Feature Extraction}{ Amazon ML Challenge}{ Sep 2024}{}

Devised a novel architecture for a deep neural model to extract numerical features like height, weight, etc. from product images. Achieved an F1 score of 0.693 and achieved Rank 14 in the contest.
\par\divider

\cvevent{Parse Probing with PEGs}{}{ Ongoing}{}

Investigating sequence models trained to replicate complex recognition grammars using mechanistic techniques to uncover parse state information.
\par\divider

\cvevent{ContractNLI}{ Course Project: Advanced NLP}{ Ongoing}{}

Uncovering circuits in monolingual language models for semantic role detection and investigating their role on morphological complexity, particularly with Indian languages.
\par\divider

\cvevent{ContractNLI}{ Course Project: Introduction to NLP}{}{}

Implemented architectural changes to baseline models trained to perform NLI on legal documents with evidential spans, achieving near-SotA performance.
\switchcolumn
\cvsection{Volunteering}
\label{sec:orgb27bb8c}

\cvevent{Problem Committee and Jury}{ Panini Linguistics Olympiad}{ Jan 2024 -- Ongoing}{}

Contributed and tested problems for the Panini Linguistics Olympiad and evaluated submissions for the National and Asia-Pacific rounds.
\par\divider

\cvevent{Coordinator, Theory Group}{ Theory Group @ IIITH}{ May 2023 -- Jun 2024}{}

Organized discussions and seminars on various topics including theoretical CS, mathematics, music theory and physics.

\par
\cvsection{Achievements}
\label{sec:orgc9d8ab9}

\cvachievement{\faTrophy}{ Amazon ML Challenge}{ Rank 14 in India}{}

\divider

\cvachievement{\faTrophy}{ Dean's List Award}{ Spring '22 and Monsoon '22}{}

\divider

\cvachievement{\faTrophy}{ International Olympiads}{ Mathematics, Linguistics, Informatics, Astronomy}{}

\par
\cvsection{Skills}
\label{sec:org37eb14a}
\cvevent{Languages:}{}{}{}
\cvtag{Python}
\cvtag{C/C++}
\cvtag{JavaScript}
\cvtag{Lisp}
\cvtag{Lua}
\cvtag{\LaTeX}
\par\divider

\cvevent{Libraries and Tools:}{}{}{}
\cvtag{Pytorch}
\cvtag{Transformers}
\cvtag{React}
\cvtag{Astro.js}
\cvtag{Vim}
\cvtag{Emacs}
\cvtag{Git}
\cvtag{SLURM}
\par
\end{paracol}
\end{document}
\end{document}
